OLD/results/results_1/aggregated/out 128/test6-img-rate1-total10-different-images/output.txt
[Tue Jul 21 11:54:46 AM UTC 2026] Waiting for http://aggregation-epp:80/v1/models ...
  Endpoint up.

[Tue Jul 21 11:54:46 AM UTC 2026] === Rate 1 ===
/usr/local/lib/python3.12/dist-packages/torchao/quantization/quant_api.py:1731: SyntaxWarning: invalid escape sequence '\.'
  """Configuration class for applying different quantization configs to modules or parameters based on their fully qualified names (FQNs).
/sgl-workspace/sglang/python/sglang/srt/layers/attention/fla/utils.py:223: UserWarning: Triton is not supported on current platform, roll back to CPU.
  warnings.warn(
Warning: You are sending unauthenticated requests to the HF Hub. Please set a HF_TOKEN to enable higher rate limits and faster downloads.
[transformers] The `use_fast` parameter is deprecated and will be removed in a future version. Use `backend="torchvision"` instead of `use_fast=True`, or `backend="pil"` instead of `use_fast=False`.
benchmark_args=Namespace(backend='sglang-oai-chat', base_url=None, host='aggregation-epp', port=80, ready_check_timeout_sec=60, dataset_name='image', dataset_path='', speed_bench_category=None, speed_bench_output_len=512, model='Qwen/Qwen3-VL-235B-A22B-Instruct-FP8', served_model_name=None, tokenizer=None, num_prompts=10, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=128, random_output_len=128, random_range_ratio=1.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=1.0, use_trace_timestamps=False, max_concurrency=None, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=42, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body='{"ignore_eos": true}', apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None,lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)
Waiting up to 60s for http://aggregation-epp:80/v1/models to become ready...
Server ready in 0.0s.
Namespace(backend='sglang-oai-chat', base_url=None, host='aggregation-epp', port=80, ready_check_timeout_sec=60, dataset_name='image', dataset_path='', speed_bench_category=None, speed_bench_output_len=512, model='Qwen/Qwen3-VL-235B-A22B-Instruct-FP8', served_model_name=None, tokenizer=None, num_prompts=10, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=128, random_output_len=128, random_range_ratio=1.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=1.0, use_trace_timestamps=False, max_concurrency=None, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=42, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body='{"ignore_eos": true}', apply_chat_template=True, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None,lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)

#Input tokens: 21852
#Output tokens: 1280
#Total images: 10
#Images per request: 1 (fixed)

=== Token Breakdown (per request avg / total) ===
  Raw text prompt tokens (without overhead): avg=128.0, total=1280
  Text prompt tokens (with chat template): avg=143.2, total=1432
  Text prompt overhead: avg=15.2, total=152
  Vision tokens: avg=2042.0, total=20420

Created 10 random jpeg images with average 2089687 bytes per request
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...
100%|██████████| 10/10 [00:13<00:00,  1.31s/it]

============ Serving Benchmark Result ============
Backend:                                 sglang-oai-chat
Traffic request rate:                    1.0       
Max request concurrency:                 not set   
Successful requests:                     10        
Benchmark duration (s):                  13.13     
Total input tokens:                      21852     
Total input text tokens:                 1432      
Total input vision tokens:               20420     
Total generated tokens:                  1280      
Total generated tokens (retokenized):    1280      
Request throughput (req/s):              0.76      
Input token throughput (tok/s):          1664.87   
Output token throughput (tok/s):         97.52     
Peak output token throughput (tok/s):    303.00    
Peak concurrent requests:                5         
Total token throughput (tok/s):          1762.39   
Concurrency:                             1.34      
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   1753.14   
Median E2E Latency (ms):                 1715.07   
P90 E2E Latency (ms):                    2054.82   
P95 E2E Latency (ms):                    2066.01   
P99 E2E Latency (ms):                    2074.96   
---------------Time to First Token----------------
Mean TTFT (ms):                          300.49    
Median TTFT (ms):                        298.70    
P90 TTFT (ms):                           328.54    
P95 TTFT (ms):                           356.41    
P99 TTFT (ms):                           378.71    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          11.44     
Median TPOT (ms):                        11.15     
P90 TPOT (ms):                           13.71     
P95 TPOT (ms):                           13.95     
P99 TPOT (ms):                           14.15     
---------------Inter-Token Latency----------------
Mean ITL (ms):                           11.57     
Median ITL (ms):                         10.22     
P90 ITL (ms):                            13.61     
P95 ITL (ms):                            13.86     
P99 ITL (ms):                            31.41     
Max ITL (ms):                            91.84     
==================================================
[Tue Jul 21 11:55:18 AM UTC 2026] Rate 1 done.
[Tue Jul 21 11:55:18 AM UTC 2026] All rates complete.